---
kind: property
id: P:Autodesk.Revit.DB.TriOrQuadFacet.NumberOfVertices
source: html/37e5adf5-13c4-486d-1f8e-c07b830d03e1.htm
---
# Autodesk.Revit.DB.TriOrQuadFacet.NumberOfVertices Property

The number of vertices (3 for a triangle, 4 for a quadrilateral, 0 for an unset TriOrQuadFacet).

## Syntax (C#)
```csharp
public int NumberOfVertices { get; }
```